docs/playground.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-19 Mon 16:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Preliminary work</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Preliminary work</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4a70ed6">1. Playground</a></li>
<li><a href="#org5b954f0">2. LJ</a></li>
<li><a href="#orgc589882">3. Design decisions</a></li>
<li><a href="#org087eb8b">4. Examples</a></li>
<li><a href="#orgc298bff">5. <span class="todo TODO">TODO</span> Questions/Hmm</a></li>
<li><a href="#org984f446">6. For Tomorrow</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4a70ed6" class="outline-2">
<h2 id="org4a70ed6"><span class="section-number-2">1.</span> Playground</h2>
<div class="outline-text-2" id="text-1">
<p>
We implemented LJ with lists, inorder to actually familiarize ourselves with (1) implementing the proof infrastructure (formulas, connectives, contexts, inference rules) and (2) formalizing metatheorems and (3) encountering the problems with context representations
</p>
</div>
</div>
<div id="outline-container-org5b954f0" class="outline-2">
<h2 id="org5b954f0"><span class="section-number-2">2.</span> LJ</h2>
<div class="outline-text-2" id="text-2">
<p>
Check LJ notes for some short description of LJ and its inference rules (typesetted). Check lj.v for the code.
</p>
</div>
</div>
<div id="outline-container-orgc589882" class="outline-2">
<h2 id="orgc589882"><span class="section-number-2">3.</span> Design decisions</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Formulas are an inductive datatype and inference rules are inductive propositions.</li>
<li>Contexts are lists of formulas.</li>
<li>Consistently put formulas at the end of the list (context).</li>
<li>Added <code>Bot</code> to represent empty sequent.</li>
<li>Redefined weakening, exchange, contraction to work on contexts and not with 1 formula to avoid some problems with ++ not being commutative  (and some other problems with lists not pattern matching with the inference rule shape). Exchange is now <code>G, D |- C -&gt; D, G |- C</code>. Weakening is now <code>G |- C -&gt; G, D |- C</code>. Contract is now <code>G, D, D |- C -&gt; G, D |- C</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-org087eb8b" class="outline-2">
<h2 id="org087eb8b"><span class="section-number-2">4.</span> Examples</h2>
<div class="outline-text-2" id="text-4">
<p>
We show do some derivations and metatheorems to show that our implementation works.
</p>
<ul class="org-ul">
<li>init</li>
<li>two small proofs</li>
<li>two cut<sub>elim</sub> cases</li>
<li>invertibility proof for each invertible inference rule</li>
</ul>
</div>
</div>
<div id="outline-container-orgc298bff" class="outline-2">
<h2 id="orgc298bff"><span class="section-number-2">5.</span> <span class="todo TODO">TODO</span> Questions/Hmm</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Will Abella being relational pose a problem for porting the lists-modulo-permutation to Coq?</li>
<li>There were certainly some automatable aspects to the proofs, defining our own tactics would be nice, but haven&rsquo;t encountered much examples yet</li>
<li>I did not do a proof that inducted on the proof tree, so I&rsquo;m not so sure about what difficulties we encounter there.</li>
</ul>
</div>
</div>
<div id="outline-container-org984f446" class="outline-2">
<h2 id="org984f446"><span class="section-number-2">6.</span> For Tomorrow</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Writing down CS4 (done) and LL using lists. In cs4.v and ll.v. There are several presentations of S4 and LL.</li>
<li>Investigating: monoids, multisets (coq lib), multisets (from ll-coq)</li>
<li>Starting reading Abella paper + Pientka paper</li>
</ul>

<hr />
<p>
<a href="index.html">Homepage</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-05-19 Mon 16:13</p>
</div>
</body>
</html>
